upstream/OpenFOAM-v2606/tutorials/compressible/sonicLiquidFoam/decompressionTank/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e+07;

boundaryField
{
    outerWall
    {
        type            zeroGradient;
    }

    axis
    {
        type            symmetryPlane;
    }

    nozzle
    {
        type            fixedValue;
        value           uniform 0;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
}


// ************************************************************************* //
